art_share_api/app/controllers/artworks_controller.rb

  def index
    artworks = Artwork.where(artist_id: params[:user_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]