art_share_api/app/controllers/artworks_controller.rb

  def index
    # owned_artworks = Artwork.where(artist_id: params[:user_id])
    user = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    artwork = Artwork.find_by(id: params[:id])
    if artwork
      if artwork.update_attributes(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "JENOVAH SAVER"], ["updated_at", "2019-10-04 07:10:55.114381"], ["id", 4]]

  def destroy
    artwork = Artwork.find_by(id: params[:id])
    if artwork
      artwork.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]

  def favorite
    artwork = Artwork.find_by(id: params[:id])
    if artwork
      artwork.update_attributes(favorite: true)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", true], ["updated_at", "2019-10-04 22:12:50.249600"], ["id", 1]]