art_share_api/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("viewer_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["viewer_id", 3], ["artwork_id", 1], ["created_at", "2019-10-04 07:49:06.337483"], ["updated_at", "2019-10-04 07:49:06.337483"]]
---
  def create
    artwork_share = ArtworkShare.new(artwork_share_params)
    if artwork_share.save

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 4]]
---
  def destroy
    artwork_share = ArtworkShare.find_by(id: params[:id])
    if artwork_share
      artwork_share.destroy

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", true], ["updated_at", "2019-10-04 22:14:09.184793"], ["id", 1]]
---
  def favorite
    artwork_share = ArtworkShare.find_by(id: params[:id])
    if artwork_share
      artwork_share.update_attributes(favorite: true)