art_share_api/app/controllers/comments_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"
---
  def index
    if params[:artwork_id]
      artwork = Artwork.find_by(id: params[:artwork_id])
      if artwork
        render json: artwork.comments
      else
        render json: "Artwork not found!", status: :not_found
      end
    elsif params[:user_id]
      user = User.find_by(id: params[:user_id])
      if user
        render json: user.comments
      else
        render json: "User not found!", status: :not_found
      end
    else
      render json: Comment.all

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    comment = Comment.find_by(id: params[:id])