art_share_api/app/controllers/users_controller.rb

  def index
    if params[:query]
      render json: User.where("username LIKE ?", "%#{params[:query]}%")
    else
      render json: User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE '%k%')
SELECT "users".* FROM "users"

  def update
    user = User.find_by(id: params[:id])
    if user
      if user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "potato"], ["updated_at", "2019-10-04 07:03:25.015024"], ["id", 5]]

  def destroy
    user = User.find_by(id: params[:id])
    if user
      user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]